python_basics.org
#+TITLE: Python Basics
#+AUTHOR: xallaxdad
#+HTML_HEAD: <link rel="stylesheet" href="https://sandyuraz.com/styles/org.css">
#+PROPERTY: header-args:python :session *python-basics* :results value verbatim :exports both

* symbols and data types

Numbers can be integers (no decimal) or floats (with a decimal point).

#+begin_src python :exports results
1
#+end_src

#+RESULTS:

#+begin_src python :exports results
3.1415
#+end_src

#+RESULTS:
: 3.1415

Literal strings and characters have quotes around them.

#+begin_src python
"this is a string"
#+end_src

#+RESULTS:
: this is a string

#+begin_src python
'this is a also a string'
#+end_src

Double quotes and single quotes are more or less the same. This is handy when you want to have a string with quotation marks in it.

#+begin_src python :results output
s1 = 'I said, "Go away"'
print(s1)
#+end_src

Single or double quoted strings can't span multiple lines, but triple-quoted strings can.

#+begin_src python :results output
s2 = """This
spans
multiple
lines"""
print(s2)
#+end_src

If you need to put a line break in a regular string, use =\n=

#+begin_src python :results output
print('line\nbreak')
#+end_src

Another "escape" character to know about is tab (=\t=):

#+begin_src python :results output
print('these\tare\ttabs')
#+end_src

Other fundamental data types are lists, tuples, dicts, and sets. Read more about these here: https://docs.python.org/3/tutorial/datastructures.html (really, read this page).

Lists and dicts are used everywhere, so we'll talk more about them here.

** lists

Lists can contain any number of values or variables. Here are two ways to create an empty list:

#+begin_src python
[]
#+end_src

#+begin_src python
list()
#+end_src

The =list()= function is used to convert other data types into lists. We'll see examples of this later.

And here's a list with values:

#+begin_src python  :results output
var = 1
mylist = [2, var, 'hithere', None]
print(mylist)
#+end_src

You can add an element to a list:

#+begin_src python  :results output
mylist.append(100)
print(mylist)
#+end_src

#+RESULTS:
: [2, 1, 'hithere', None, 100]

We'll talk about what =.append()= is later under "objects".

Lists can also be combined with a =+=.

#+begin_src python
[1, 2, 3] + ['hi', 'there']
#+end_src

You can access individual items in a list using square brackets. The first element is accessed using a "0"

#+begin_src python  :results output
print(mylist[0])
#+end_src

Sequences of elements can be accessed by "slicing"

#+begin_src python  :results output
print(mylist[1:3])
#+end_src

#+RESULTS:
: [1, 'hithere']

Notice that the slice extends from the position identified by the first number through the position *before* the last number.

This means "elements from the beginning to the position before the number after the colon"

#+begin_src python
mylist[:3]
#+end_src

And this means "elements from the position at the number before the colon to the end"

#+begin_src python
mylist[3:]
#+end_src

Lists can be indexed using negative numbers, and slices can use negative numbers, too

#+begin_src python :results output
print(mylist)
print(mylist[-1])
#+end_src

#+begin_src python
mylist[:-1]
#+end_src

** dicts

Dicts provide a "mapping" from "keys" to "values". Here are two ways to create an empty dicts

#+begin_src python
{}
#+end_src

#+begin_src python
dict()
#+end_src

Some examples of creating dicts with values:

#+begin_src python
mydict = dict(cats=2, dogs=3, monkeys=4)
#+end_src

#+begin_src python
mydict = {'cats': 2, 'dogs': 3, 'monkeys': 4}
#+end_src

The two dicts are the same. Notice that in the first example the keys do not have quotes, but in the second they do. The reason for this will become more clear when we talk about functions.

'cats', 'dogs', and 'monkeys' are "keys"; 2, 3, and 4 are values. You can get each of these using the methods below:

#+begin_src python
mydict.keys()
#+end_src

#+begin_src python
mydict.values()
#+end_src

#+begin_src python
mydict.items()
#+end_src

Retrieve individual elements using square brackets:

#+begin_src python
mydict['cats']
#+end_src

Square brackets are also used to add items:

#+begin_src python
mydict['fish'] = 0
mydict
#+end_src

Trying to access a key that does not exist causes an error

#+begin_src python :exports code :eval no
mydict['wild boars']
#+end_src

#+begin_src
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
KeyError: 'wild boars'
#+end_src

The =.get()= method can be used to avoid the error, and returns None by default if the key is missing.

#+begin_src python
mydict.get('wild boars')
#+end_src

You can also provide a default value.

#+begin_src python
mydict.get('wild boars', 'many')
#+end_src

