python_basics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-29 Sat 21:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python Basics</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="xallaxdad" />
<link rel="stylesheet" href="https://sandyuraz.com/styles/org.css">
</head>
<body>
<div id="content">
<h1 class="title">Python Basics</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org091867d">1. symbols and data types</a>
<ul>
<li><a href="#org46b548a">1.1. lists</a></li>
<li><a href="#orga304e4c">1.2. dicts</a></li>
</ul>
</li>
<li><a href="#orgb301407">2. operators</a></li>
<li><a href="#org94a71e4">3. variables</a></li>
<li><a href="#org46bdce9">4. conditionals (if&#x2026;elif&#x2026;else)</a></li>
<li><a href="#org399b508">5. indentation and whitespace</a></li>
<li><a href="#org0848c52">6. iteration (for loops, list comprehensions)</a></li>
<li><a href="#orge38dc89">7. functions</a></li>
<li><a href="#org2054769">8. objects</a></li>
<li><a href="#orgd348ef9">9. Notes</a></li>
</ul>
</div>
</div>

<div id="outline-container-org091867d" class="outline-2">
<h2 id="org091867d"><span class="section-number-2">1</span> symbols and data types</h2>
<div class="outline-text-2" id="text-1">
<p>
Numbers can be integers (no decimal) or floats (with a decimal point).
</p>

<pre class="example">
1
</pre>


<pre class="example">
3.1415
</pre>


<p>
Literal strings and characters have quotes around them.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #af875f;">"this is a string"</span>
</pre>
</div>

<pre class="example">
this is a string
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #af875f;">'this is a also a string'</span>
</pre>
</div>

<pre class="example">
this is a also a string
</pre>


<p>
Double quotes and single quotes are more or less the same. This is handy when you want to have a string with quotation marks in it.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8787d7;">s1</span> = <span style="color: #2aa198;">'I said, "Go away"'</span>
<span style="color: #268bd2; font-weight: bold;">print</span>(s1)
</pre>
</div>

<pre class="example">
I said, "Go away"
</pre>


<p>
Single or double quoted strings can't span multiple lines, but triple-quoted strings can.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8787d7;">s2</span> = <span style="color: #2aa198;">"""This</span>
<span style="color: #2aa198;">spans</span>
<span style="color: #2aa198;">multiple</span>
<span style="color: #2aa198;">lines"""</span>
<span style="color: #268bd2; font-weight: bold;">print</span>(s2)
</pre>
</div>

<pre class="example">
This
spans
multiple
lines
</pre>


<p>
If you need to put a line break in a regular string, use <code>\n</code>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'line\nbreak'</span>)
</pre>
</div>

<pre class="example">
line
break
</pre>


<p>
Another "escape" character to know about is tab (<code>\t</code>):
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'these\tare\ttabs'</span>)
</pre>
</div>

<pre class="example">
these	are	tabs
</pre>


<p>
Other fundamental data types are lists, tuples, dicts, and sets. Read more about these here: <a href="https://docs.python.org/3/tutorial/datastructures.html">https://docs.python.org/3/tutorial/datastructures.html</a> (really, read this page).
</p>

<p>
Lists and dicts are used everywhere, so we'll talk more about them here.
</p>
</div>

<div id="outline-container-org46b548a" class="outline-3">
<h3 id="org46b548a"><span class="section-number-3">1.1</span> lists</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Lists can contain any number of values or variables. Here are two ways to create an empty list:
</p>

<div class="org-src-container">
<pre class="src src-python">[]
</pre>
</div>

<pre class="example">
[]
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">list</span>()
</pre>
</div>

<pre class="example">
[]
</pre>


<p>
The <code>list()</code> function is used to convert other data types into lists. We'll see examples of this later.
</p>

<p>
And here's a list with values:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8787d7;">var</span> = 1
<span style="color: #8787d7;">mylist</span> = [2, var, <span style="color: #2aa198;">'hithere'</span>, <span style="color: #d75fd7;">None</span>]
<span style="color: #268bd2; font-weight: bold;">print</span>(mylist)
</pre>
</div>

<pre class="example">
[2, 1, 'hithere', None]
</pre>


<p>
You can add an element to a list:
</p>

<div class="org-src-container">
<pre class="src src-python">mylist.append(100)
<span style="color: #268bd2; font-weight: bold;">print</span>(mylist)
</pre>
</div>

<pre class="example">
[2, 1, 'hithere', None, 100]
</pre>


<p>
We'll talk about what <code>.append()</code> is later under "objects".
</p>

<p>
Lists can also be combined with a <code>+</code>.
</p>

<div class="org-src-container">
<pre class="src src-python">[1, 2, 3] + [<span style="color: #2aa198;">'hi'</span>, <span style="color: #2aa198;">'there'</span>]
</pre>
</div>

<pre class="example">
[1, 2, 3, 'hi', 'there']
</pre>


<p>
You can access individual items in a list using square brackets. The first element is accessed using a "0"
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">print</span>(mylist[0])
</pre>
</div>

<pre class="example">
2
</pre>


<p>
Sequences of elements can be accessed by "slicing"
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">print</span>(mylist[1:3])
</pre>
</div>

<pre class="example">
[1, 'hithere']
</pre>


<p>
Notice that the slice extends from the position identified by the first number through the position <b>before</b> the last number.
</p>

<p>
This means "elements from the beginning to the position before the number after the colon"
</p>

<div class="org-src-container">
<pre class="src src-python">mylist[:3]
</pre>
</div>

<pre class="example">
[2, 1, 'hithere']
</pre>


<p>
And this means "elements from the position at the number before the colon to the end"
</p>

<div class="org-src-container">
<pre class="src src-python">mylist[3:]
</pre>
</div>

<pre class="example">
[None, 100]
</pre>


<p>
Lists can be indexed using negative numbers, and slices can use negative numbers, too
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">print</span>(mylist)
<span style="color: #268bd2; font-weight: bold;">print</span>(mylist[-1])
</pre>
</div>

<pre class="example">
[2, 1, 'hithere', None, 100]
100
</pre>


<div class="org-src-container">
<pre class="src src-python">mylist[:-1]
</pre>
</div>

<pre class="example">
[2, 1, 'hithere', None]
</pre>
</div>
</div>

<div id="outline-container-orga304e4c" class="outline-3">
<h3 id="orga304e4c"><span class="section-number-3">1.2</span> dicts</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Dicts provide a "mapping" from "keys" to "values". Here are two ways to create an empty dicts
</p>

<div class="org-src-container">
<pre class="src src-python">{}
</pre>
</div>

<pre class="example">
{}
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">dict</span>()
</pre>
</div>

<pre class="example">
{}
</pre>


<p>
Some examples of creating dicts with values:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8787d7;">mydict</span> = <span style="color: #268bd2;">dict</span>(cats=2, dogs=3, monkeys=4)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8787d7;">mydict</span> = {<span style="color: #2aa198;">'cats'</span>: 2, <span style="color: #2aa198;">'dogs'</span>: 3, <span style="color: #2aa198;">'monkeys'</span>: 4}
</pre>
</div>

<p>
The two dicts are the same. Notice that in the first example the keys do not have quotes, but in the second they do. The reason for this will become more clear when we talk about functions.
</p>

<p>
'cats', 'dogs', and 'monkeys' are "keys"; 2, 3, and 4 are values. You can get each of these using the methods below:
</p>

<div class="org-src-container">
<pre class="src src-python">mydict.keys()
</pre>
</div>

<pre class="example">
dict_keys(['cats', 'dogs', 'monkeys'])
</pre>


<div class="org-src-container">
<pre class="src src-python">mydict.values()
</pre>
</div>

<pre class="example">
dict_values([2, 3, 4])
</pre>


<div class="org-src-container">
<pre class="src src-python">mydict.items()
</pre>
</div>

<pre class="example">
dict_items([('cats', 2), ('dogs', 3), ('monkeys', 4)])
</pre>


<p>
Retrieve individual elements using square brackets:
</p>

<div class="org-src-container">
<pre class="src src-python">mydict[<span style="color: #2aa198;">'cats'</span>]
</pre>
</div>

<pre class="example">
2
</pre>


<p>
Square brackets are also used to add items:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8787d7;">mydict</span>[<span style="color: #2aa198;">'fish'</span>] = 0
mydict
</pre>
</div>

<pre class="example">
{'cats': 2, 'dogs': 3, 'monkeys': 4, 'fish': 0}
</pre>


<p>
Trying to access a key that does not exist causes an error
</p>

<div class="org-src-container">
<pre class="src src-python">mydict[<span style="color: #2aa198;">'wild boars'</span>]
</pre>
</div>

<pre class="example">
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 1, in &lt;module&gt;
KeyError: 'wild boars'
</pre>

<p>
The <code>.get()</code> method can be used to avoid the error, and returns None by default if the key is missing.
</p>

<div class="org-src-container">
<pre class="src src-python">mydict.get(<span style="color: #2aa198;">'wild boars'</span>)
</pre>
</div>

<pre class="example">
None
</pre>


<p>
You can also provide a default value.
</p>

<div class="org-src-container">
<pre class="src src-python">mydict.get(<span style="color: #2aa198;">'wild boars'</span>, <span style="color: #2aa198;">'many'</span>)
</pre>
</div>

<pre class="example">
many
</pre>
</div>
</div>
</div>
