python_basics.org
* operators

Many other symbols are called *operators*. Many of them should be pretty familiar.

Some examples are

| symbol | meaning  | example |
| +      | add      | 1 + 1   |
| *      | multiply | 4 * 2   |
| /      | divide   | 4 / 2   |
| ^      | exponent | 2 ^ 2   |

You don't need spaces around operators, but the recommended style is to include them.

#+begin_src python
1 + 1
#+end_src

#+begin_src python
2 * 3
#+end_src

Operators do different things based on the context. For example, the plus symbol adds numbers, but concatenates (combines) strings:

#+begin_src python
'hi' + 'there'
#+end_src

Sometimes operators can be used to combine different data types.

#+begin_src python
'hi' * 10
#+end_src

And sometimes this causes an error if the operator is not supported.

#+begin_src python :exports code :eval no
'hi' / 10
#+end_src

#+begin_src
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
TypeError: unsupported operand type(s) for /: 'str' and 'int'
#+end_src

* variables

In the example above, =s1= and =s2= are "variables". They are assigned values with a single equals sign (we'll talk about double equals signs later).

Variables can contain

- uppercase or lowercase letters in any position
- numbers in any position after the first character
- underscores

But that's it. No other characters are allowed.

You can change the value of a variable after you create it

#+begin_src python :results output
var = 1
var = 'hello'
print(var)
#+end_src

It is even possible to update variables in place:

#+begin_src python :results output
var = 1
var += 2
print(var)
#+end_src

In this example, the =+== operator updates =var= to its current value plus two.

