python_basics.html

<div id="outline-container-orgb301407" class="outline-2">
<h2 id="orgb301407"><span class="section-number-2">2</span> operators</h2>
<div class="outline-text-2" id="text-2">
<p>
Many other symbols are called <b>operators</b>. Many of them should be pretty familiar.
</p>

<p>
Some examples are
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">symbol</td>
<td class="org-left">meaning</td>
<td class="org-left">example</td>
</tr>

<tr>
<td class="org-left">+</td>
<td class="org-left">add</td>
<td class="org-left">1 + 1</td>
</tr>

<tr>
<td class="org-left">*</td>
<td class="org-left">multiply</td>
<td class="org-left">4 * 2</td>
</tr>

<tr>
<td class="org-left">^</td>
<td class="org-left">exponent</td>
<td class="org-left">2 ^ 2</td>
</tr>
</tbody>
</table>

<p>
You don't need spaces around operators, but the recommended style is to include them.
</p>

<div class="org-src-container">
<pre class="src src-python">1 + 1
</pre>
</div>

<pre class="example">
2
</pre>


<div class="org-src-container">
<pre class="src src-python">2 * 3
</pre>
</div>

<pre class="example">
6
</pre>


<p>
Operators do different things based on the context. For example, the plus symbol adds numbers, but concatenates (combines) strings:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #af875f;">'hi'</span> + <span style="color: #af875f;">'there'</span>
</pre>
</div>

<pre class="example">
hithere
</pre>


<p>
Sometimes operators can be used to combine different data types.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #af875f;">'hi'</span> * 10
</pre>
</div>

<pre class="example">
hihihihihihihihihihi
</pre>


<p>
And sometimes this causes an error if the operator is not supported.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #af875f;">'hi'</span> / 10
</pre>
</div>

<pre class="example">
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 1, in &lt;module&gt;
TypeError: unsupported operand type(s) for /: 'str' and 'int'
</pre>
</div>
</div>

<div id="outline-container-org94a71e4" class="outline-2">
<h2 id="org94a71e4"><span class="section-number-2">3</span> variables</h2>
<div class="outline-text-2" id="text-3">
<p>
In the example above, <code>s1</code> and <code>s2</code> are "variables". They are assigned values with a single equals sign (we'll talk about double equals signs later).
</p>

<p>
Variables can contain
</p>

<ul class="org-ul">
<li>uppercase or lowercase letters in any position</li>
<li>numbers in any position after the first character</li>
<li>underscores</li>
</ul>

<p>
But that's it. No other characters are allowed.
</p>

<p>
You can change the value of a variable after you create it
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8787d7;">var</span> = 1
<span style="color: #8787d7;">var</span> = <span style="color: #2aa198;">'hello'</span>
<span style="color: #268bd2; font-weight: bold;">print</span>(var)
</pre>
</div>

<pre class="example">
hello
</pre>


<p>
It is even possible to update variables in place:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8787d7;">var</span> = 1
<span style="color: #8787d7;">var</span> += 2
<span style="color: #268bd2; font-weight: bold;">print</span>(var)
</pre>
</div>

<pre class="example">
3
</pre>


<p>
In this example, the <code>+=</code> operator updates <code>var</code> to its current value plus two.
</p>
</div>
</div>
