python_basics.org
* conditionals (if...elif...else)

=True= and =False= are special symbols called booleans. =None= is used to represent an empty value.

These are special because they cannot be assigned to.

#+begin_src python :results output :eval False
True = 'hithere'
#+end_src

#+begin_src
  File "<stdin>", line 1
    True = 'hithere'
    ^
SyntaxError: cannot assign to True
#+end_src

Booleans are used to describe whether a condition is true or false. Conditional expressions evaluate to booleans!

Here's an example:

#+begin_src python
2 < 3
#+end_src

#+RESULTS:
: True

#+begin_src python
2 > 3
#+end_src

#+RESULTS:
: False

Equality is tested using two equals signs (note the difference between this and a single = used for assigning a value to a variable).

#+begin_src python
2 == 2
#+end_src

#+RESULTS:
: True

Here are some other comparison operators:

| operator | meaning               |
| >=       | greater than or equal |
| <=       | less than or equal    |
| !=       | not equal             |

Note that you can "reverse" the value of a boolean using "not":

#+begin_src python
not True
#+end_src

A common use for expressions that evaluate to booleans is in conditional "if" statements. If statements have the following form (not real python):

#+begin_src
if expression:
    statement
    another statement
#+end_src

Here "expression" is python code that evaluates into True or False as in the examples above. Statements are lines of code that are evaluated if the expression is true. Here are some examples. Note that the line containing the expression must end with a colon, and the lines of code below are indented. We'll talk about that more later.

#+begin_src python  :results output
if 1 == 1:
    print('yes, one is equal to one')
#+end_src

#+begin_src python  :results output
if 1 == 2:
    print('this does not print')
#+end_src

The statement in an "else" clause is always evaluated if the "if" statement is not True:

#+begin_src python  :results output
if 1 == 2:
    print('this does not print')
else:
    print('but this does')
#+end_src

Use "elif" to test for other conditions after the if:

#+begin_src python  :results output
if 1 == 2:
    print('this does not print')
elif 1 == 3:
    print('this does not print')
elif 1 == 1:
    print('this does print!')
else:
    print('always prints if none of the above are true')
#+end_src

"Empty" values of most data types are "falsy" (evaluate to False in a conditional expression), whereas other values are "truthy" (evaluate to True). A common use for this is to test for empty strings, lists, etc.

#+begin_src python
var1 = []
var2 = ''
var3 = 0

if var1:
    print('this does not print')
elif var2:
    print('this does not print')
elif var3:
    print('this does not print')
else:
    print('this does print!')
#+end_src

You can check if a value is "truthy" using =bool()=, which converts a statement into a boolean.

#+begin_src python :results output
for thing in ['', 0, 0.0, [], {}, set()]:
    print([thing, type(thing), bool(thing)])
#+end_src

#+RESULTS:
: ['', <class 'str'>, False]
: [0, <class 'int'>, False]
: [0.0, <class 'float'>, False]
: [[], <class 'list'>, False]
: [{}, <class 'dict'>, False]
: [set(), <class 'set'>, False]

#+begin_src python :results output
for thing in ['hithere', 1, 1.0, [2, 3], {'cats': 1}, {1, 2, 3}]:
    print([thing, type(thing), bool(thing)])
#+end_src

#+RESULTS:
: hithere <class 'str'> True
: 1 <class 'int'> True
: [2, 3] <class 'list'> True
: {'cats': 1} <class 'dict'> True
: {1, 2, 3} <class 'set'> True

* indentation and whitespace

You might have noticed something new in the example above: some lines are indented from the left margin. Python code is organized using indentation. Indented code can be thought of as being within a "block" started by an unindented line and ending with a colon (:). The lines below are not valid python, but they should give you the general idea:

#+begin_src
start of code block 1:
    in code block 1
    also in code block 1
start of code block 2:
    in code block 2

Not in a code block
#+end_src

If statements and function definitions are the two most basic examples of code blocks that you may come across, but there are others.

For now, just follow the rule that each level of indentation is four spaces. Many editors used to write python will insert 4 spaces when you press the tab key at the beginning of a line.  They may also automatically indent to 4 spaces after you press return at the end of a line that starts a code block (like the first line of an if statement).

