python_basics.html

<div id="outline-container-org46bdce9" class="outline-2">
<h2 id="org46bdce9"><span class="section-number-2">4</span> conditionals (if&#x2026;elif&#x2026;else)</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>True</code> and <code>False</code> are special symbols called booleans. <code>None</code> is used to represent an empty value.
</p>

<p>
These are special because they cannot be assigned to.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #d75fd7;">True</span> = <span style="color: #2aa198;">'hithere'</span>
</pre>
</div>

<pre class="example">
  File "&lt;stdin&gt;", line 1
    True = 'hithere'
    ^
SyntaxError: cannot assign to True
</pre>

<p>
Booleans are used to describe whether a condition is true or false. Conditional expressions evaluate to booleans!
</p>

<p>
Here's an example:
</p>

<div class="org-src-container">
<pre class="src src-python">2 &lt; 3
</pre>
</div>

<pre class="example">
True
</pre>


<div class="org-src-container">
<pre class="src src-python">2 &gt; 3
</pre>
</div>

<pre class="example">
False
</pre>


<p>
Equality is tested using two equals signs (note the difference between this and a single = used for assigning a value to a variable).
</p>

<div class="org-src-container">
<pre class="src src-python">2 == 2
</pre>
</div>

<pre class="example">
True
</pre>


<p>
Here are some other comparison operators:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">operator</td>
<td class="org-left">meaning</td>
</tr>

<tr>
<td class="org-left">&gt;=</td>
<td class="org-left">greater than or equal</td>
</tr>

<tr>
<td class="org-left">&lt;=</td>
<td class="org-left">less than or equal</td>
</tr>

<tr>
<td class="org-left">!=</td>
<td class="org-left">not equal</td>
</tr>
</tbody>
</table>

<p>
Note that you can "reverse" the value of a boolean using "not":
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">not</span> <span style="color: #d75fd7;">True</span>
</pre>
</div>

<pre class="example">
False
</pre>


<p>
A common use for expressions that evaluate to booleans is in conditional "if" statements. If statements have the following form (not real python):
</p>

<pre class="example">
if expression:
    statement
    another statement
</pre>

<p>
Here "expression" is python code that evaluates into True or False as in the examples above. Statements are lines of code that are evaluated if the expression is true. Here are some examples. Note that the line containing the expression must end with a colon, and the lines of code below are indented. We'll talk about that more later.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">if</span> 1 == 1:
    <span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'yes, one is equal to one'</span>)
</pre>
</div>

<pre class="example">
yes, one is equal to one
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">if</span> 1 == 2:
    <span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'this does not print'</span>)
</pre>
</div>

<p>
The statement in an "else" clause is always evaluated if the "if" statement is not True:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">if</span> 1 == 2:
    <span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'this does not print'</span>)
<span style="color: #268bd2; font-weight: bold;">else</span>:
    <span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'but this does'</span>)
</pre>
</div>

<pre class="example">
but this does
</pre>


<p>
Use "elif" to test for other conditions after the if:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">if</span> 1 == 2:
    <span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'this does not print'</span>)
<span style="color: #268bd2; font-weight: bold;">elif</span> 1 == 3:
    <span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'this does not print'</span>)
<span style="color: #268bd2; font-weight: bold;">elif</span> 1 == 1:
    <span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'this does print!'</span>)
<span style="color: #268bd2; font-weight: bold;">else</span>:
    <span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'always prints if none of the above are true'</span>)
</pre>
</div>

<pre class="example">
this does print!
</pre>


<p>
"Empty" values of most data types are "falsy" (evaluate to False in a conditional expression), whereas other values are "truthy" (evaluate to True). A common use for this is to test for empty strings, lists, etc.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8787d7;">var1</span> = []
<span style="color: #8787d7;">var2</span> = <span style="color: #2aa198;">''</span>
<span style="color: #8787d7;">var3</span> = 0

<span style="color: #268bd2; font-weight: bold;">if</span> var1:
    <span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'this does not print'</span>)
<span style="color: #268bd2; font-weight: bold;">elif</span> var2:
    <span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'this does not print'</span>)
<span style="color: #268bd2; font-weight: bold;">elif</span> var3:
    <span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'this does not print'</span>)
<span style="color: #268bd2; font-weight: bold;">else</span>:
    <span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'this does print!'</span>)
</pre>
</div>

<p>
You can check if a value is "truthy" using <code>bool()</code>, which converts a statement into a boolean.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">for</span> thing <span style="color: #268bd2; font-weight: bold;">in</span> [<span style="color: #2aa198;">''</span>, 0, 0.0, [], {}, <span style="color: #268bd2;">set</span>()]:
    <span style="color: #268bd2; font-weight: bold;">print</span>([thing, <span style="color: #268bd2;">type</span>(thing), <span style="color: #268bd2;">bool</span>(thing)])
</pre>
</div>

<pre class="example">
['', &lt;class 'str'&gt;, False]
[0, &lt;class 'int'&gt;, False]
[0.0, &lt;class 'float'&gt;, False]
[[], &lt;class 'list'&gt;, False]
[{}, &lt;class 'dict'&gt;, False]
[set(), &lt;class 'set'&gt;, False]
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">for</span> thing <span style="color: #268bd2; font-weight: bold;">in</span> [<span style="color: #2aa198;">'hithere'</span>, 1, 1.0, [2, 3], {<span style="color: #2aa198;">'cats'</span>: 1}, {1, 2, 3}]:
    <span style="color: #268bd2; font-weight: bold;">print</span>([thing, <span style="color: #268bd2;">type</span>(thing), <span style="color: #268bd2;">bool</span>(thing)])
</pre>
</div>

<pre class="example">
['hithere', &lt;class 'str'&gt;, True]
[1, &lt;class 'int'&gt;, True]
[1.0, &lt;class 'float'&gt;, True]
[[2, 3], &lt;class 'list'&gt;, True]
[{'cats': 1}, &lt;class 'dict'&gt;, True]
[{1, 2, 3}, &lt;class 'set'&gt;, True]
</pre>
</div>
</div>

<div id="outline-container-org399b508" class="outline-2">
<h2 id="org399b508"><span class="section-number-2">5</span> indentation and whitespace</h2>
<div class="outline-text-2" id="text-5">
<p>
You might have noticed something new in the example above: some lines are indented from the left margin. Python code is organized using indentation. Indented code can be thought of as being within a "block" started by an unindented line and ending with a colon (:). The lines below are not valid python, but they should give you the general idea:
</p>

<pre class="example">
start of code block 1:
    in code block 1
    also in code block 1
start of code block 2:
    in code block 2

Not in a code block
</pre>

<p>
If statements and function definitions are the two most basic examples of code blocks that you may come across, but there are others.
</p>

<p>
For now, just follow the rule that each level of indentation is four spaces. Many editors used to write python will insert 4 spaces when you press the tab key at the beginning of a line.  They may also automatically indent to 4 spaces after you press return at the end of a line that starts a code block (like the first line of an if statement).
</p>
</div>
</div>
