python_basics.org
* iteration (for loops, list comprehensions)

"Iteration" means "doing something multiple times." The most recognizable syntax for iteration is the for loop. For loops look like this (not real python):

#+begin_src
for variable in sequence_of_variables:
    some indented code
    more indented codes

code not in the for loop
#+end_src

Like "if...elif...else" (conditional) code blocks, the first line of a for loop ends with a colon and lines after are indented. Here is a real for loop:

#+begin_src python :results output
for var in [1, 2, 3]:
    print(var)
#+end_src

Since it is very common to want to iterate over a sequence of numbers, for loops often use the =range()= function.

#+begin_src python
list(range(10))
#+end_src

#+RESULTS:
: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

(I'll have to explain later why we used =list()= to show the output of =range()=)

The output of =range()= starts with a 0 by default, but you can change this:

#+begin_src python
list(range(1, 10))
#+end_src

#+RESULTS:
: [1, 2, 3, 4, 5, 6, 7, 8, 9]

=range()= is very handy for for loops when we want to do something a specified number of times:

#+begin_src python :results output
for i in range(3):
    print(i)
#+end_src

In the example above, note that we are using =i= as the variable in the first line. The name of the variable doesn't matter: the important thing is that with each iteration of the loop, the variable named in the first line is assigned a different value with each cycle of the loop.

The =sequence_of_items= does not need to be numbers:

#+begin_src python :results output
for color in ['red', 'orange', 'blue']:
    print(color)
#+end_src

* functions

At last! Functions. Functions allow you to re-use code. Function are created
using the =def= keyword, followed by a pair of parentheses and a colon, and then
one or more indented lines. Here's a simple function that takes no arguments
(that is, you can't pass any variables into the function).

#+begin_src python
def say_hello():
    print('hello!')
#+end_src

When you want to use (or "call") a function, you must enter the function name
followed by a pair of parentheses.

#+begin_src python :results output
say_hello()
#+end_src

Functions are more useful when you can pass values into them that change their
behavior. These are called "arguments". These can be "positional" (they are
recognized based on their position and are required) or "keyword" (must be used
by providing their names). Here's a function with a single positional argument,
=name=.

#+begin_src python :results output
def say_hello(name):
    print('hello', name)

say_hello('xallax')
#+end_src

Here's a function with both a positional argument (=name=) and a keyword
argument (=times=), indicating how many times to repeat the message. Keyword
arguments can be given default values that will be used if no value is given
(remember, positional arguments are required).

#+begin_src python :results output
def say_hello(name, times=1):
    for i in range(times):
        print('hello', name)

say_hello('xallax')
#+end_src

Because we called the function without providing a value for =times= it used the
default value of 1.

#+begin_src python :results output
say_hello('xallax', times=3)
#+end_src

Most functions have a "return value", or a value produced by calling the function. If you do not specify a return value, then =None= is returned. This function prints a message, but does not return anything. Here we are creating a variable =myvar= and assigning the value that is returned by =say_hello()=.

#+begin_src python :results output
myvar = say_hello('xallax')
print(myvar)
#+end_src

If you do want to return a value, use the =return= keyword. If =return= is used,
the function execution immediately ends and the function returns the value and
exits.

#+begin_src python :results output
def say_hello(name, times=1):
    for i in range(times):
        print('hello', name)

    return f'I said hello {times} times'

message = say_hello('xallax', 2)
#+end_src

What happened here? Why don't we see the message? Because it was just assigned
to the variable =message= and nothing else was done with it.

#+begin_src python :results output
message = say_hello('xallax', 2)
print(message)
#+end_src

There it is.

What's the point of functions? They can be used to run the same code multiple
times but using different values. Whenever you see yourself writing very similar
code multiple times, consider creating a function.

One more thing about functions for now: functions can "see" variables created
outside the function, but variables created /inside/ the function can't be
seen outside of the function body (the term for where variable can be seen is
"scope").

#+begin_src python :results output
x = 'created outside'

def say_something():
    print(f'the variable x has the value "{x}"')
    y = 'created inside'

say_something()
print(y)
#+end_src

#+begin_src
NameError: name 'y' is not defined
#+end_src

In general, don't access variables (especially those that you want to change)
without passing them in as arguments if you can avoid it.

