python_basics.html

<div id="outline-container-org0848c52" class="outline-2">
<h2 id="org0848c52"><span class="section-number-2">6</span> iteration (for loops, list comprehensions)</h2>
<div class="outline-text-2" id="text-6">
<p>
"Iteration" means "doing something multiple times." The most recognizable syntax for iteration is the for loop. For loops look like this (not real python):
</p>

<pre class="example">
for variable in sequence_of_variables:
    some indented code
    more indented codes

code not in the for loop
</pre>

<p>
Like "if&#x2026;elif&#x2026;else" (conditional) code blocks, the first line of a for loop ends with a colon and lines after are indented. Here is a real for loop:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">for</span> var <span style="color: #268bd2; font-weight: bold;">in</span> [1, 2, 3]:
    <span style="color: #268bd2; font-weight: bold;">print</span>(var)
</pre>
</div>

<pre class="example">
1
2
3
</pre>


<p>
Since it is very common to want to iterate over a sequence of numbers, for loops often use the <code>range()</code> function.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">list</span>(<span style="color: #268bd2;">range</span>(10))
</pre>
</div>

<pre class="example">
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
</pre>


<p>
(I'll have to explain later why we used <code>list()</code> to show the output of <code>range()</code>)
</p>

<p>
The output of <code>range()</code> starts with a 0 by default, but you can change this:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">list</span>(<span style="color: #268bd2;">range</span>(1, 10))
</pre>
</div>

<pre class="example">
[1, 2, 3, 4, 5, 6, 7, 8, 9]
</pre>


<p>
<code>range()</code> is very handy for for loops when we want to do something a specified number of times:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">for</span> i <span style="color: #268bd2; font-weight: bold;">in</span> <span style="color: #268bd2;">range</span>(3):
    <span style="color: #268bd2; font-weight: bold;">print</span>(i)
</pre>
</div>

<pre class="example">
0
1
2
</pre>


<p>
In the example above, note that we are using <code>i</code> as the variable in the first line. The name of the variable doesn't matter: the important thing is that with each iteration of the loop, the variable named in the first line is assigned a different value with each cycle of the loop.
</p>

<p>
The <code>sequence_of_items</code> does not need to be numbers:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">for</span> color <span style="color: #268bd2; font-weight: bold;">in</span> [<span style="color: #2aa198;">'red'</span>, <span style="color: #2aa198;">'orange'</span>, <span style="color: #2aa198;">'blue'</span>]:
    <span style="color: #268bd2; font-weight: bold;">print</span>(color)
</pre>
</div>

<pre class="example">
red
orange
blue
</pre>
</div>
</div>

<div id="outline-container-orge38dc89" class="outline-2">
<h2 id="orge38dc89"><span class="section-number-2">7</span> functions</h2>
<div class="outline-text-2" id="text-7">
<p>
At last! Functions. Functions allow you to re-use code. Function are created
using the <code>def</code> keyword, followed by a pair of parentheses and a colon, and then
one or more indented lines. Here's a simple function that takes no arguments
(that is, you can't pass any variables into the function).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #d75fd7; font-weight: bold;">say_hello</span>():
    <span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'hello!'</span>)
</pre>
</div>

<p>
When you want to use (or "call") a function, you must enter the function name
followed by a pair of parentheses.
</p>

<div class="org-src-container">
<pre class="src src-python">say_hello()
</pre>
</div>

<pre class="example">
hello!
</pre>


<p>
Functions are more useful when you can pass values into them that change their
behavior. These are called "arguments". These can be "positional" (they are
recognized based on their position and are required) or "keyword" (must be used
by providing their names). Here's a function with a single positional argument,
<code>name</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #d75fd7; font-weight: bold;">say_hello</span>(name):
    <span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'hello'</span>, name)

say_hello(<span style="color: #2aa198;">'xallax'</span>)
</pre>
</div>

<pre class="example">
hello xallax
</pre>


<p>
Here's a function with both a positional argument (<code>name</code>) and a keyword
argument (<code>times</code>), indicating how many times to repeat the message. Keyword
arguments can be given default values that will be used if no value is given
(remember, positional arguments are required).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #d75fd7; font-weight: bold;">say_hello</span>(name, times=1):
    <span style="color: #268bd2; font-weight: bold;">for</span> i <span style="color: #268bd2; font-weight: bold;">in</span> <span style="color: #268bd2;">range</span>(times):
        <span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'hello'</span>, name)

say_hello(<span style="color: #2aa198;">'xallax'</span>)
</pre>
</div>

<pre class="example">
hello xallax
</pre>


<p>
Because we called the function without providing a value for <code>times</code> it used the
default value of 1.
</p>

<div class="org-src-container">
<pre class="src src-python">say_hello(<span style="color: #2aa198;">'xallax'</span>, times=3)
</pre>
</div>

<pre class="example">
hello xallax
hello xallax
hello xallax
</pre>


<p>
Most functions have a "return value", or a value produced by calling the function. If you do not specify a return value, then <code>None</code> is returned. This function prints a message, but does not return anything. Here we are creating a variable <code>myvar</code> and assigning the value that is returned by <code>say_hello()</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8787d7;">myvar</span> = say_hello(<span style="color: #2aa198;">'xallax'</span>)
<span style="color: #268bd2; font-weight: bold;">print</span>(myvar)
</pre>
</div>

<pre class="example">
hello xallax
None
</pre>


<p>
If you do want to return a value, use the <code>return</code> keyword. If <code>return</code> is used,
the function execution immediately ends and the function returns the value and
exits.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #d75fd7; font-weight: bold;">say_hello</span>(name, times=1):
    <span style="color: #268bd2; font-weight: bold;">for</span> i <span style="color: #268bd2; font-weight: bold;">in</span> <span style="color: #268bd2;">range</span>(times):
        <span style="color: #268bd2; font-weight: bold;">print</span>(<span style="color: #2aa198;">'hello'</span>, name)

    <span style="color: #268bd2; font-weight: bold;">return</span> f<span style="color: #2aa198;">'I said hello {times} times'</span>

<span style="color: #8787d7;">message</span> = say_hello(<span style="color: #2aa198;">'xallax'</span>, 2)
</pre>
</div>

<pre class="example">
hello xallax
hello xallax
</pre>


<p>
What happened here? Why don't we see the message? Because it was just assigned
to the variable <code>message</code> and nothing else was done with it.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8787d7;">message</span> = say_hello(<span style="color: #2aa198;">'xallax'</span>, 2)
<span style="color: #268bd2; font-weight: bold;">print</span>(message)
</pre>
</div>

<pre class="example">
hello xallax
hello xallax
I said hello 2 times
</pre>


<p>
There it is.
</p>

<p>
What's the point of functions? They can be used to run the same code multiple
times but using different values. Whenever you see yourself writing very similar
code multiple times, consider creating a function.
</p>

<p>
One more thing about functions for now: functions can "see" variables created
outside the function, but variables created <i>inside</i> the function can't be
seen outside of the function body (the term for where variable can be seen is
"scope").
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8787d7;">x</span> = <span style="color: #2aa198;">'created outside'</span>

<span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #d75fd7; font-weight: bold;">say_something</span>():
    <span style="color: #268bd2; font-weight: bold;">print</span>(f<span style="color: #2aa198;">'the variable x has the value "{x}"'</span>)
    <span style="color: #8787d7;">y</span> = <span style="color: #2aa198;">'created inside'</span>

say_something()
<span style="color: #268bd2; font-weight: bold;">print</span>(y)
</pre>
</div>

<pre class="example">
the variable x has the value "created outside"
</pre>


<pre class="example">
NameError: name 'y' is not defined
</pre>



<p>
In general, don't do this! It is much better to pass variables into functions
using arguments.
</p>
</div>
</div>
