python_basics.org
* objects

Everything in python is an *object*. Objects have properties called *attributes* (variables associated with an object) and *methods* (functions associated with the object). These terms aren't terribly important right now but you may see them in documentation. You can "access" an attribute or method using a period character. We already saw an example of a method above when we added an element to a list (~mylist.append(100)~) and looked up the value of a key in a dict (~mydict.get('wild boars', 'many')~).

* Notes

- If you want to as a question at the prompt, use =input()=.

