python_basics.html

<div id="outline-container-org2054769" class="outline-2">
<h2 id="org2054769"><span class="section-number-2">8</span> objects</h2>
<div class="outline-text-2" id="text-8">
<p>
Everything in python is an <b>object</b>. Objects have properties called <b>attributes</b> (variables associated with an object) and <b>methods</b> (functions associated with the object). These terms aren't terribly important right now but you may see them in documentation. You can "access" an attribute or method using a period character. We already saw an example of a method above when we added an element to a list (<code>mylist.append(100)</code>) and looked up the value of a key in a dict (<code>mydict.get('wild boars', 'many')</code>).
</p>
</div>
</div>

<div id="outline-container-orgd348ef9" class="outline-2">
<h2 id="orgd348ef9"><span class="section-number-2">9</span> Notes</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>If you want to as a question at the prompt, use <code>input()</code>.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: xallaxdad</p>
<p class="date">Created: 2022-01-29 Sat 21:19</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
